janputra/STM32_rs485_slave/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define a_Pin GPIO_PIN_0
#define a_GPIO_Port GPIOA
#define b_Pin GPIO_PIN_1
#define b_GPIO_Port GPIOA
#define c_Pin GPIO_PIN_2
#define c_GPIO_Port GPIOA
#define d_Pin GPIO_PIN_3
#define d_GPIO_Port GPIOA
#define e_Pin GPIO_PIN_4
#define e_GPIO_Port GPIOA
#define f_Pin GPIO_PIN_5
#define f_GPIO_Port GPIOA
#define g_Pin GPIO_PIN_6
#define g_GPIO_Port GPIOA
#define key_Pin GPIO_PIN_0
#define key_GPIO_Port GPIOB
#define TX_EN_Pin GPIO_PIN_8
#define TX_EN_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */
#define SEGMENT_PORT GPIOA

#define KEY_PRESSED 0b1100     
#define KEY_RELEASED 0b0011

#define CHECKSUM_ERROR 0
#define CHECKSUM_NO_ERROR 1

#define EVENT_RESET 0
#define EVENT_KEY_PRESSED 1
#define EVENT_KEY_RELEASED 2
#define EVENT_RX_COMPLETE 3

#define STATE_WAITING_ADDR 0
#define STATE_OPERATION 1

#define MSG_ERROR 0
#define MSG_WRITE_REQ 1
#define MSG_READ_REQ 2
#define MSG_NO_PROCESS 3

#define SLAVE_2 //SLAVE_2
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
